{
  "architectures": [
    "Mammothmoda2Model"
  ],
  "bos_token_id": 152068,
  "dtype": "bfloat16",
  "eos_token_id": 151643,
  "gen_axes_dim_rope": [
    40,
    40,
    40
  ],
  "gen_axes_lens": [
    10000,
    10000,
    10000
  ],
  "gen_condition_layer_merger": "pooling",
  "gen_condition_layers": [
    -2,
    -5,
    -8,
    -11,
    -14,
    -17
  ],
  "gen_condition_mode": "text_image",
  "gen_dit_config": {
    "_class_name": "OmniGen2Transformer2DModel",
    "_diffusers_version": "0.33.1",
    "axes_dim_rope": [
      40,
      40,
      40
    ],
    "axes_lens": [
      1024,
      1664,
      1664
    ],
    "ffn_dim_multiplier": null,
    "hidden_size": 2520,
    "in_channels": 16,
    "multiple_of": 256,
    "norm_eps": 1e-05,
    "num_attention_heads": 21,
    "num_kv_heads": 7,
    "num_layers": 16,
    "num_refiner_layers": 2,
    "out_channels": null,
    "patch_size": 2,
    "text_feat_dim": 4096,
    "timestep_scale": 1000.0
  },
  "gen_image_condition_refiner_config": {
    "num_layers": 2,
    "num_queries": 64
  },
  "gen_text_condition_max_seq_len": 512,
  "gen_text_condition_with_answer": false,
  "gen_transport_config": {
    "do_shift": true,
    "seq_len": 4096,
    "snr_type": "lognorm"
  },
  "gen_vae_config": {
    "_class_name": "AutoencoderKL",
    "_diffusers_version": "0.30.0.dev0",
    "_name_or_path": "../checkpoints/flux-dev",
    "act_fn": "silu",
    "block_out_channels": [
      128,
      256,
      512,
      512
    ],
    "down_block_types": [
      "DownEncoderBlock2D",
      "DownEncoderBlock2D",
      "DownEncoderBlock2D",
      "DownEncoderBlock2D"
    ],
    "force_upcast": true,
    "in_channels": 3,
    "latent_channels": 16,
    "latents_mean": null,
    "latents_std": null,
    "layers_per_block": 2,
    "mid_block_add_attention": true,
    "norm_num_groups": 32,
    "out_channels": 3,
    "sample_size": 1024,
    "scaling_factor": 0.3611,
    "shift_factor": 0.1159,
    "up_block_types": [
      "UpDecoderBlock2D",
      "UpDecoderBlock2D",
      "UpDecoderBlock2D",
      "UpDecoderBlock2D"
    ],
    "use_post_quant_conv": false,
    "use_quant_conv": false
  },
  "initializer_range": 0.02,
  "llm_config": {
    "dtype": "bfloat16",
    "extra_gen_vocab": true,
    "gen_vocab_size": 32800,
    "gen_vocab_start_index": 152064,
    "image_token_id": 151655,
    "model_type": "mammothmoda2_qwen3_vl",
    "moe_type": "ffn-18:36",
    "text_config": {
      "_name_or_path": "",
      "add_cross_attention": false,
      "architectures": null,
      "attention_bias": false,
      "attention_dropout": 0.0,
      "bad_words_ids": null,
      "begin_suppress_tokens": null,
      "bos_token_id": 151643,
      "chunk_size_feed_forward": 0,
      "cross_attention_hidden_size": null,
      "decoder_start_token_id": null,
      "diversity_penalty": 0.0,
      "do_sample": false,
      "dtype": "float32",
      "early_stopping": false,
      "encoder_no_repeat_ngram_size": 0,
      "eos_token_id": 151645,
      "exponential_decay_length_penalty": null,
      "extra_gen_vocab": true,
      "finetuning_task": null,
      "forced_bos_token_id": null,
      "forced_eos_token_id": null,
      "gen_vocab_size": 32800,
      "gen_vocab_start_index": 152064,
      "head_dim": 128,
      "hidden_act": "silu",
      "hidden_size": 4096,
      "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
      },
      "initializer_range": 0.02,
      "intermediate_size": 12288,
      "is_decoder": false,
      "is_encoder_decoder": false,
      "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
      },
      "length_penalty": 1.0,
      "max_length": 20,
      "max_position_embeddings": 262144,
      "min_length": 0,
      "model_type": "mammothmoda2_qwen3_vl_text",
      "moe_type": "ffn-18:36",
      "no_repeat_ngram_size": 0,
      "num_attention_heads": 32,
      "num_beam_groups": 1,
      "num_beams": 1,
      "num_hidden_layers": 36,
      "num_key_value_heads": 8,
      "num_return_sequences": 1,
      "output_attentions": false,
      "output_hidden_states": false,
      "output_scores": false,
      "pad_token_id": null,
      "prefix": null,
      "problem_type": null,
      "pruned_heads": {},
      "remove_invalid_values": false,
      "repetition_penalty": 1.0,
      "return_dict": true,
      "return_dict_in_generate": false,
      "rms_norm_eps": 1e-06,
      "rope_scaling": {
        "mrope_interleaved": true,
        "mrope_section": [
          24,
          20,
          20
        ],
        "rope_type": "default"
      },
      "rope_theta": 5000000,
      "sep_token_id": null,
      "suppress_tokens": null,
      "task_specific_params": null,
      "temperature": 1.0,
      "tf_legacy_loss": false,
      "tie_encoder_decoder": false,
      "tie_word_embeddings": false,
      "tokenizer_class": null,
      "top_k": 50,
      "top_p": 1.0,
      "torchscript": false,
      "typical_p": 1.0,
      "unpack_forward": true,
      "use_bfloat16": false,
      "use_cache": true,
      "vocab_size": 151936
    },
    "unpack_forward": true,
    "use_cache": true,
    "video_token_id": 151656,
    "vision_config": {
      "_name_or_path": "",
      "add_cross_attention": false,
      "architectures": null,
      "bad_words_ids": null,
      "begin_suppress_tokens": null,
      "bos_token_id": null,
      "chunk_size_feed_forward": 0,
      "cross_attention_hidden_size": null,
      "decoder_start_token_id": null,
      "deepstack_visual_indexes": [
        8,
        16,
        24
      ],
      "depth": 27,
      "diversity_penalty": 0.0,
      "do_sample": false,
      "dtype": null,
      "early_stopping": false,
      "encoder_no_repeat_ngram_size": 0,
      "eos_token_id": null,
      "exponential_decay_length_penalty": null,
      "finetuning_task": null,
      "forced_bos_token_id": null,
      "forced_eos_token_id": null,
      "hidden_act": "gelu_pytorch_tanh",
      "hidden_size": 1152,
      "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
      },
      "in_channels": 3,
      "initializer_range": 0.02,
      "intermediate_size": 4304,
      "is_decoder": false,
      "is_encoder_decoder": false,
      "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
      },
      "length_penalty": 1.0,
      "max_length": 20,
      "min_length": 0,
      "model_type": "mammothmoda2_qwen3_vl",
      "no_repeat_ngram_size": 0,
      "num_beam_groups": 1,
      "num_beams": 1,
      "num_heads": 16,
      "num_position_embeddings": 2304,
      "num_return_sequences": 1,
      "out_hidden_size": 4096,
      "output_attentions": false,
      "output_hidden_states": false,
      "output_scores": false,
      "pad_token_id": null,
      "patch_size": 16,
      "prefix": null,
      "problem_type": null,
      "pruned_heads": {},
      "remove_invalid_values": false,
      "repetition_penalty": 1.0,
      "return_dict": true,
      "return_dict_in_generate": false,
      "sep_token_id": null,
      "spatial_merge_size": 2,
      "suppress_tokens": null,
      "task_specific_params": null,
      "temperature": 1.0,
      "temporal_patch_size": 2,
      "tf_legacy_loss": false,
      "tie_encoder_decoder": false,
      "tie_word_embeddings": true,
      "tokenizer_class": null,
      "top_k": 50,
      "top_p": 1.0,
      "torchscript": false,
      "typical_p": 1.0,
      "use_bfloat16": false
    },
    "vision_end_token_id": 151653,
    "vision_start_token_id": 151652
  },
  "llm_moe_init_gen_from_und": true,
  "llm_pretrained_path": null,
  "model_type": "mammothmoda2",
  "pad_token_id": 151643,
  "transformers_version": "4.57.1",
  "unpack_forward": true,
  "verbose_interval": 200,
  "vis_freeze": true,
  "shift": 1.0,
  "use_real_rope": true,
  "use_negative_cfg": true,
  "sample_steps": 50,
  "cfg_scale": 6.0,
  "sde_sample": true,
  "eta": 0.5,
  "eps_schedule": "constant",
  "eps_power": 2.0,
  "eps_min_ratio": 0.0,
  "num_images_per_prompt": 2,
  "text_guidance_scale": 5.0,
  "image_guidance_scale": 2.0,
  "vae_scale_factor": 16,
  "cfg_range": [
    0.0,
    1.0
  ],
  "num_inference_steps": 50,
  "height": 1024,
  "width": 1024,
  "max_side_length": 2048,
  "max_pixels": 1048576
}